src/Catalogs/ЭквайринговыеТерминалы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ЭквайринговыеТерминалы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьБезПодключенияОборудования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОплатуПоСсылке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыПлатежногоШлюза</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодключаемоеОборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентКомиссии</Name>
					<Comment>Процент комиссии</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипБанка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПлатежныеШлюзы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипФискализации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыФискализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЭквайринга</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЭквайринговыхТерминалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Эквайер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассовыйСервер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ТипыФискализации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыФискализации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВСбербанке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВСДМБанке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВТинькофф</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КассовыйСервер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеФискализировать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОнлайнКасса</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ПлатежныеШлюзы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ПлатежныеШлюзы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сбербанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СбербанкПлатиQR</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБПАльфаБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБПРайффайзенБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБПСбербанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБПСДМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СБПТинькофф</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыЭквайринговыхТерминалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыЭквайринговыхТерминалов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Онлайн</Name>
					<Comment>Интернет эквайринг без терминала</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Торговый</Name>
					<Comment>Физический терминал в торговой точке</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыКасс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКасс</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КассаПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперационнаяКасса</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ВнешниеСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВнешниеСистемы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторизацияПоКодуБезСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Comment>Внешняя система используется</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючШифрования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючШифрованияОбратногоЗвонка</Name>
					<Comment>Используется для обратного звонка в CRM</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синхронизирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВнешнейСистемы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВнешнихСистем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенДоступа</Name>
					<Comment>Используется для отправки Push уведомлений</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УправлениеВЛичномКабинете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ЭквайринговыеТерминалы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
// Процедура - обработчик события "ПриСозданииНаСервере" формы.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Подсистема запрета редактирования ключевых реквизитов объектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма, ЭтаФорма.Элементы.ГруппаДляКнопкиЗапрета);
	
	ЭтотОбъект.ОтображниеКода						= ПолучитьФункциональнуюОпцию("ПоказыватьКодСправочников");			
	ЭтотОбъект.ДрайверОборудованияКассовогоСервера	= ПолучитьДрайверКассовогоСервера();
	ЭтотОбъект.КлючСохраненияПоложенияОкна			= Новый УникальныйИдентификатор();
	ЭтотОбъект.Касса								= ?(Объект.Ссылка.Пустая() = Ложь, Справочники.Кассы.ПолучитьКассуПоЭквайринговомуТерминалу(Объект.Ссылка), Неопределено);
	
	Объект.ТипФискализации = ?(Не ЗначениеЗаполнено(Объект.ТипФискализации), Перечисления.ТипыФискализации.НеФискализировать, Объект.ТипФискализации);
		
	Если РольДоступна("ПолныеПрава") = Ложь И РольДоступна("ДобавлениеИзменениеБазовойНСИ") = Ложь И РольДоступна("ДобавлениеИзменениеДокументовПоОплате") = Ложь Тогда		
		Элементы.ГруппаИнформация.Доступность                       = Ложь;
		Элементы.ГруппаДополнительно.Доступность                    = Ложь;
		Элементы.ГруппаБанка.Доступность                    		= Ложь;	
		Элементы.ГруппаПереключательТипЭквайринга.Доступность		= Ложь;
		Элементы.ИспользоватьБезПодключенияОборудования.Доступность = Истина; 			
	КонецЕсли;
		
	ОбработатьИзменениеТипаФискализации(ЭтаФорма, Объект.ТипФискализации);
	ЗаполнитьПараметрыПлатежногоШлюза();
	
	Если Не Объект.Ссылка.Пустая() Тогда	
		ЭтаФорма.АвтоЗаголовок = Ложь;
		ЭтаФорма.Заголовок = Объект.Наименование + " (эквайринг)";                  
	КонецЕсли;
	
	Если Объект.ТипФискализации = Перечисления.ТипыФискализации.КассовыйСервер Тогда
		ЗаполнитьСписокВыбораКассовогоСервера(Объект.ТипФискализации, Объект.Организация, Элементы.КассовыйСервер);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриОткрытии".
//
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьОплатыПоСсылке(Истина);
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПередЗаписью" формы.
//
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	Если ПустаяСтрока(Объект.Наименование) Тогда
		Объект.Наименование = СформироватьАвтоНаименование();
	КонецЕсли;
		
	ЭтоСбербанк			= Объект.ТипБанка = ПредопределенноеЗначение("Перечисление.ПлатежныеШлюзы.Сбербанк");
	ЭтоАльфаБанкСБП		= Объект.ТипБанка = ПредопределенноеЗначение("Перечисление.ПлатежныеШлюзы.СБПАльфаБанк");
	ЭтоТинькоффСБП		= Объект.ТипБанка = ПредопределенноеЗначение("Перечисление.ПлатежныеШлюзы.СБПТинькофф");
	РайффайзенБанкСБП	= Объект.ТипБанка = ПредопределенноеЗначение("Перечисление.ПлатежныеШлюзы.СБПРайффайзенБанк");
	ЭтоСберБанкСБП      = Объект.ТипБанка = ПредопределенноеЗначение("Перечисление.ПлатежныеШлюзы.СБПСбербанк");
	ЭтоСбербанкПлатиQR  = Объект.ТипБанка = ПредопределенноеЗначение("Перечисление.ПлатежныеШлюзы.СбербанкПлатиQR");
	ЭтоСДМСБП			= Объект.ТипБанка = ПредопределенноеЗначение("Перечисление.ПлатежныеШлюзы.СБПСДМ");
	
	Если Объект.ТипЭквайринга = ПредопределенноеЗначение("Перечисление.ТипыЭквайринговыхТерминалов.Онлайн") И Не ЗначениеЗаполнено(Объект.ТипБанка) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для использования онлайн эквайрингов необходимо заполнить платежный шлюз.");
		Отказ = Истина;
		
	ИначеЕсли (ЭтоАльфаБанкСБП ИЛИ РайффайзенБанкСБП ИЛИ (Объект.ИспользоватьОплатуПоСсылке И ЭтоСбербанк)) 
		И (Не ЗначениеЗаполнено(ЭтотОбъект.ЛогинБанка) ИЛИ Не ЗначениеЗаполнено(ЭтотОбъект.ПарольБанка) ИЛИ Не ЗначениеЗаполнено(ЭтотОбъект.UrlRedirect)) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить логин банка, пароль банка и url переадресации.");
		Отказ = Истина;
					
	ИначеЕсли (ЭтоТинькоффСБП ИЛИ ЭтоСДМСБП) И (Не ЗначениеЗаполнено(КлючТерминалаТинькофф) ИЛИ Не ЗначениеЗаполнено(СекретныйКлючТинькофф)) Тогда
		
		СообщениеПользователю = СтрШаблон("Для использования оплаты по ссылке необходимо заполнить ключ терминала и %1", ?(ЭтоСДМСБП, "пароль ключа.", "секретный ключ.")); 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеПользователю);
		Отказ = Истина;
		
	ИначеЕсли ЭтоСберБанкСБП И Не ЗначениеЗаполнено(ЭтотОбъект.IDТерминала) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для использования СБП СберБанк необходимо заполнить ID терминала.");
		Отказ = Истина;		
		
	ИначеЕсли ЭтоСДМСБП И ОбщегоНазначенияКлиентСервер.СтрокаСодержитТолькоДопустимыеСимволы(КлючТерминалаТинькофф, "0123456789") = Ложь Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ключ терминала для СДМ банка должен содержать только числовые значения.");
		Отказ = Истина;	
		
	ИначеЕсли ЭтоСбербанкПлатиQR И (Не ЗначениеЗаполнено(ЭтотОбъект.IDТерминала) ИЛИ Не ЗначениеЗаполнено(ЭтотОбъект.IDQR)) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для использования Сбербанк Плати QR необходимо заполнить ID терминала и ID QR.");
		Отказ = Истина;	
		
	КонецЕсли;	
	
	Если Объект.ТипФискализации <> ПредопределенноеЗначение("Перечисление.ТипыФискализации.НеФискализировать")
		И Объект.ТипФискализации <> ПредопределенноеЗначение("Перечисление.ТипыФискализации.ВСбербанке")
		И Объект.ТипФискализации <> ПредопределенноеЗначение("Перечисление.ТипыФискализации.ВТинькофф")
		И Объект.ТипФискализации <> ПредопределенноеЗначение("Перечисление.ТипыФискализации.ВСДМБанке")
		И Не ЗначениеЗаполнено(Объект.КассовыйСервер) Тогда
		
		Если Объект.ТипФискализации = ПредопределенноеЗначение("Перечисление.ТипыФискализации.КассовыйСервер") Тогда
			Перем_ТипФискализации = "кассовый сервер.";	
		Иначе 
			Перем_ТипФискализации = "онлайн кассу.";
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполните " + Перем_ТипФискализации);
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик события "ПередЗаписьюНаСервер".
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.Ссылка.Пустая() = Ложь Тогда
		
		Если ТекущийОбъект.ТипФискализации = Перечисления.ТипыФискализации.КассовыйСервер Тогда
			
			ПараметрыКассовогоСервера	= ТекущийОбъект.КассовыйСервер.Параметры.Получить();
			КассаКассовогоСервера		= ?(ТипЗнч(ПараметрыКассовогоСервера) = Тип("Структура") И ПараметрыКассовогоСервера.Свойство("КассаОплаты"), ПараметрыКассовогоСервера.КассаОплаты, Неопределено);
			
			Если ЭтотОбъект.Касса <> КассаКассовогоСервера Тогда			
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не удалось записать. Эквайринговый терминал привязан к кассе, которая не принадлежит кассе выбранного кассового сервера - %1.", Строка(КассаКассовогоСервера)));
				Отказ = Истина;
				Возврат;
			КонецЕсли;
			
		ИначеЕсли ТекущийОбъект.ТипФискализации = Перечисления.ТипыФискализации.ОнлайнКасса Тогда
			
			КассаПО = ПолучитьКассуПодключаемогоОборудования(ТекущийОбъект.КассовыйСервер);
			
			Если КассаПО <> Неопределено И КассаПО <> ЭтотОбъект.Касса Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не удалось записать. Эквайринговый терминал привязан к кассе, которая не принадлежит кассе выбранной онлайн кассы - %1.", Строка(КассаПО)));
				Отказ = Истина;
				Возврат;	
			КонецЕсли;
			
		Иначе
			
			КассаЭТ = ПолучитьКассуЭквайринга(ТекущийОбъект.Ссылка);
			
			Если КассаЭТ <> Неопределено И КассаЭТ <> ЭтотОбъект.Касса Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Не удалось записать. Эквайринговый терминал привязан в другой кассе - %1.", Строка(КассаЭТ)));
				Отказ = Истина;
				Возврат;	
			КонецЕсли;		
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(АдресШаблона) Тогда
		ТекущийОбъект.Шаблон = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресШаблона));
	КонецЕсли;
	
	СохранитьПараметрыПлатежногоШлюза(ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
// Процедура - обработчик события "ПослеЗаписиНаСервере" формы.
//
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
		
	// подсистема запрета редактирования ключевых реквизитов объектов	
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтаФорма);
	
	Если ТекущийОбъект.ТипБанка = Перечисления.ПлатежныеШлюзы.СБПРайффайзенБанк 
		ИЛИ ТекущийОбъект.ТипБанка = Перечисления.ПлатежныеШлюзы.СБПТинькофф 
		ИЛИ ТекущийОбъект.ТипБанка = Перечисления.ПлатежныеШлюзы.СБПАльфаБанк
		ИЛИ ТекущийОбъект.ТипБанка = Перечисления.ПлатежныеШлюзы.СБПСбербанк
		ИЛИ ТекущийОбъект.ТипБанка = Перечисления.ПлатежныеШлюзы.СбербанкПлатиQR
		ИЛИ ТекущийОбъект.ТипБанка = Перечисления.ПлатежныеШлюзы.СБПСДМ Тогда
		
		ВнешняяСистема = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.СистемаБыстрыхПлатежей, Ложь); 
		
		Если Не ЗначениеЗаполнено(ВнешняяСистема) Тогда
			Возврат;
		КонецЕсли;
		
		ОбновитьВнешнююСистему(ВнешняяСистема);
		
		Если ТекущийОбъект.ТипБанка = Перечисления.ПлатежныеШлюзы.СБПРайффайзенБанк Тогда
			ПрокинутьВебХукВСБП();
		КонецЕсли;
		
	КонецЕсли;		
	
	ДобавитьВКассуЭквайринговыйТерминал();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура - обработчик события "НачалоВыбораИзСписка" поля "Наименование".
//
Процедура НаименованиеНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СформироватьАвтоНаименование();
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("НаименованиеНачалоПослеВыбора", ЭтотОбъект), Элементы.Наименование.СписокВыбора, Элемент);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Наименование начало после выбора
//
// Параметры:
//  ВыбранныйЭлемент		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура НаименованиеНачалоПослеВыбора(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		Объект.Наименование = ВыбранныйЭлемент.Значение;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - Использовать без подключения оборудования при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ИспользоватьБезПодключенияОборудованияПриИзменении(Элемент)
	
	Элементы.ВнешнееОборудование.Доступность = Не Объект.ИспользоватьБезПодключенияОборудования;
	
КонецПроцедуры  

&НаКлиенте
// Процедура, обработчик события "НачалоВыбора"
//
Процедура БанковскийСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.БанковскиеСчета.ФормаВыбора", Новый Структура("Отбор", Новый Структура("Владелец", Объект.Организация)), Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении"
//
Процедура БанковскийСчетПриИзменении(Элемент)
		
	СформироватьАвтоНаименование();
	
КонецПроцедуры 

&НаКлиенте
// Процедура - Организация при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.КассовыйСервер) и ЗначениеЗаполнено(Объект.Организация) Тогда
		ОрганизацияКассовогоСервера = ПолучитьЗначенияРеквизитовПоСсылке(ОбъекТ.КассовыйСервер, "Организация");
		
		Если Объект.Организация <> ОрганизацияКассовогоСервера Тогда
			Объект.КассовыйСервер = Неопределено;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выбранная организация не соответствует раннее выбранному кассовому серверу, пожалуйста заполните кассовый сервер.");
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Тип банка при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ТипБанкаПриИзменении(Элемент)
	
	Если Объект.ТипБанка <> ПредопределенноеЗначение("Перечисление.ПлатежныеШлюзы.Сбербанк") Тогда
		
		Объект.ИспользоватьОплатуПоСсылке = Ложь;
		
	КонецЕсли;
		
	УстановитьВидимостьОплатыПоСсылке();
	
	ЭтотОбъект.ТестовыйРежим = Ложь;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Эквайрер при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ЭквайрерПриИзменении(Элемент)
	СформироватьАвтоНаименование();
КонецПроцедуры

&НаКлиенте
// Процедура - Кассовый сервер начало выбора
//
// Параметры:
//  Элемент				 - 	 - 
//  ДанныеВыбора		 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура КассовыйСерверНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗаполнитьСписокВыбораКассовогоСервера(Объект.ТипФискализации, Объект.Организация, Элементы.КассовыйСервер);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Кассовый сервер авто подбор
//
// Параметры:
//  Элемент					 - 	 - 
//  Текст					 - 	 - 
//  ДанныеВыбора			 - 	 - 
//  ПараметрыПолученияДанных - 	 - 
//  Ожидание				 - 	 - 
//  СтандартнаяОбработка	 - 	 - 
//
Процедура КассовыйСерверАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если СтрДлина(Текст) > 2 Тогда
		ДанныеВыбора = ПолучитьКассовыеСервераПоДрайверуОборудования(Объект.ТипФискализации, Объект.Организация, Текст);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Процедура - Кассовый сервер при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура КассовыйСерверПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.КассовыйСервер) Тогда
		ЭтотОбъект.Касса = Неопределено;
	ИначеЕсли Объект.ТипФискализации = ПредопределенноеЗначение("Перечисление.ТипыФискализации.КассовыйСервер") Тогда
		ЭтотОбъект.Касса = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Объект.КассовыйСервер, "Касса");
	Иначе		
		ЭтотОбъект.Касса = ПолучитьКассуПодключаемогоОборудования(Объект.КассовыйСервер);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Касса начало выбора
//
// Параметры:
//  Элемент				 - 	 - 
//  ДанныеВыбора		 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура КассаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.Кассы.ФормаВыбора", Новый Структура("Отбор", Новый Структура("Организация, ТипКассы", Объект.Организация, ПредопределенноеЗначение("Перечисление.ТипыКасс.ОперационнаяКасса"))), Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	

КонецПроцедуры

&НаКлиенте
// Процедура - Декорация получить QRНажатие
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ДекорацияПолучитьQRНажатие(Элемент)
	
	Если ЗначениеЗаполнено(UrlRedirect) Тогда	
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияФормыГенерацииQR", ЭтотОбъект);
		
		СтруктураПараметров = Новый Структура();
		СтруктураПараметров.Вставить("UrlRedirect"			, UrlRedirect);
		СтруктураПараметров.Вставить("ЭквайринговыйТерминал", Объект.Ссылка);
	    СтруктураПараметров.Вставить("АдресШаблона"			, АдресШаблона);
		
		ОткрытьФорму("Справочник.ЭквайринговыеТерминалы.Форма.ФормаГенерацииQRКодаЭквайринга", СтруктураПараметров,,,,, ОписаниеОповещения);
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Обработчик команды, создаваемой механизмом запрета редактирования ключевых реквизитов.
//
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	
	Если Не Объект.Ссылка.Пустая() Тогда
		ОткрытьФорму("Справочник.ЭквайринговыеТерминалы.Форма.РазблокированиеРеквизитов",,,,,,Новый ОписаниеОповещения("РазрешитьРедактированиеРеквизитовОбъектаЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Скопировать строку
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура СкопироватьСтроку(Команда)
	
	ИмяЭлемента   = СтрРазделить(ЭтаФорма.ТекущийЭлемент.Имя, "_");
	ВыбранноеПоле = ?(ИмяЭлемента.Количество() > 1, ИмяЭлемента[1], Неопределено);
	Если ЗначениеЗаполнено(ВыбранноеПоле) Тогда
		
		Если ВыбранноеПоле = "Tinkoff" Тогда
			АдресРесурса = ЭтотОбъект.СсылкаНаОплатуТинькофф;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(АдресРесурса) Тогда
			ОбъектHtml = Новый COMОбъект("htmlfile");
			ОбъектHtml.ParentWindow.ClipboardData.Setdata("Text", АдресРесурса); 
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Скрыть показать дополнительно
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура СкрытьПоказатьДополнительно(Команда)
	Элементы.ГруппаДополнительно.Видимость = Не Элементы.ГруппаДополнительно.Видимость;
КонецПроцедуры

&НаКлиенте
// Процедура, обрабтчик команды "ОтобразитьВыборТиповФискализации".
//
Процедура ОтобразитьВыборТиповФискализации(Команда)
	
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить(ПредопределенноеЗначение("Перечисление.ТипыФискализации.КассовыйСервер")   , "Кассовый сервер");
	СписокЗначений.Добавить(ПредопределенноеЗначение("Перечисление.ТипыФискализации.НеФискализировать"), "Не фискализировать");
	
	Если Объект.ТипБанка = ПредопределенноеЗначение("Перечисление.ПлатежныеШлюзы.Сбербанк") Тогда 
		СписокЗначений.Добавить(ПредопределенноеЗначение("Перечисление.ТипыФискализации.ВСбербанке"), "В Сбербанке");
	КонецЕсли;
	
	Если Объект.ТипБанка = ПредопределенноеЗначение("Перечисление.ПлатежныеШлюзы.СБПТинькофф") Тогда 
		СписокЗначений.Добавить(ПредопределенноеЗначение("Перечисление.ТипыФискализации.ВТинькофф"), "В Тинькофф");
	КонецЕсли;
	
	Если Объект.ТипБанка = ПредопределенноеЗначение("Перечисление.ПлатежныеШлюзы.СБПСДМ") Тогда 
		СписокЗначений.Добавить(ПредопределенноеЗначение("Перечисление.ТипыФискализации.ВСДМБанке"), "В СДМ банке");
	КонецЕсли;
	
	ПоказатьВыборИзМеню(Новый ОписаниеОповещения("ВыборКассовогоСервераИлиОнлайнКассы", ЭтотОбъект), СписокЗначений, Элементы.ОтобразитьВыборТиповФискализации);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Переключатель онлайн эквайринг
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ПереключательОнлайнЭквайринг(Команда)
	
	Объект.ТипЭквайринга = ПредопределенноеЗначение("Перечисление.ТипыЭквайринговыхТерминалов.Онлайн");
	ТипЭквайрингаПриИзменении(ЭтаФорма);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Переключатель торговый эквайринг
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ПереключательТорговыйЭквайринг(Команда)
	
	Объект.ТипЭквайринга = ПредопределенноеЗначение("Перечисление.ТипыЭквайринговыхТерминалов.Торговый");
	ТипЭквайрингаПриИзменении(ЭтаФорма);
    Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Сгенерировать ссылку
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура СгенерироватьСсылку(Команда)
	
	ПараметрыПШ = Новый Структура;
	ПараметрыПШ.Вставить("КлючТерминалаТинькофф", ЭтотОбъект.КлючТерминалаТинькофф);
	ПараметрыПШ.Вставить("СекретныйКлючТинькофф", ЭтотОбъект.СекретныйКлючТинькофф);
	ПараметрыПШ.Вставить("ВремяЖизни"			, ЭтотОбъект.ВремяЖизниСсылкиНаОплату);
	ПараметрыПШ.Вставить("ТестовыйРежим"		, Ложь);
	
	РезультатЗапроса = СсылкиНаОплатуИСБП.Тинькофф_ИнициализацияПлатежнойСессии(ПараметрыПШ, 10);
	
	Если РезультатЗапроса.ВыполненоУспешно Тогда
		ЭтотОбъект.СсылкаНаОплатуТинькофф = РезультатЗапроса.ПараметрыРезультата.PaymentURL;
	Иначе
		ОписаниеОшибки = ?(ЗначениеЗаполнено(РезультатЗапроса.ОписаниеОшибки), РезультатЗапроса.ОписаниеОшибки, "Ошибка при генерации ссылки"); 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура, устанавливает видимость оплаты по ссылке.
//
Процедура УстановитьВидимостьОплатыПоСсылке(ПриСоздании = Ложь)
	
	Для Каждого КнопкиЗапретаРедактирования Из Элементы.ГруппаДляКнопкиЗапрета.ПодчиненныеЭлементы Цикл
		КнопкиЗапретаРедактирования.Отображение = ОтображениеКнопки.КартинкаИТекст;
		КнопкиЗапретаРедактирования.ОтображениеФигуры = ОтображениеФигурыКнопки.Нет;
		КнопкиЗапретаРедактирования.Картинка = БиблиотекаКартинок.РедактироватьВыделенные;
		Прервать;
	КонецЦикла;
	
	ЭтоАльфаБанкСБП	 	 = (Объект.ТипБанка = ПредопределенноеЗначение("Перечисление.ПлатежныеШлюзы.СБПАльфаБанк"));
	ЭтоТинькоффСБП	  	 = (Объект.ТипБанка = ПредопределенноеЗначение("Перечисление.ПлатежныеШлюзы.СБПТинькофф"));
	ЭтоРайффайзенБанкСБП = (Объект.ТипБанка = ПредопределенноеЗначение("Перечисление.ПлатежныеШлюзы.СБПРайффайзенБанк"));
	ЭтоСберБанкСБП       = (Объект.ТипБанка = ПредопределенноеЗначение("Перечисление.ПлатежныеШлюзы.СБПСбербанк"));
	ЭтоСбербанкПлатиQR	 = (Объект.ТипБанка = ПредопределенноеЗначение("Перечисление.ПлатежныеШлюзы.СбербанкПлатиQR"));
	ЭтоСБПСДМ	  	 	 = (Объект.ТипБанка = ПредопределенноеЗначение("Перечисление.ПлатежныеШлюзы.СБПСДМ"));
	
	Элементы.Код.Видимость						= ОтображниеКода;
	Элементы.Код.ПоложениеЗаголовка 			= ?(ОтображниеКода, ПоложениеЗаголовкаЭлементаФормы.Авто, ПоложениеЗаголовкаЭлементаФормы.Нет);
	Элементы.ВнешнееОборудование.Доступность	= Не Объект.ИспользоватьБезПодключенияОборудования;
	Элементы.UrlRedirect.ТолькоПросмотр			= ЭтоРайффайзенБанкСБП ИЛИ ЭтоТинькоффСБП ИЛИ ЭтоСБПСДМ ИЛИ ЭтоАльфаБанкСБП ИЛИ ЭтоСберБанкСБП ИЛИ ЭтоСбербанкПлатиQR;
	Элементы.ТестовыйРежим.Видимость 				  = Не ЭтоСберБанкСБП И Не ЭтоСбербанкПлатиQR;
	Элементы.ТипБанка.АвтоМаксимальнаяШирина          = Не Элементы.ТестовыйРежим.Видимость;
	Элементы.ИспользоватьОплатуПоСсылке.Видимость	  = Не ЭтоРайффайзенБанкСБП И Не ЭтоТинькоффСБП И Не ЭтоСБПСДМ И Не ЭтоАльфаБанкСБП И Не ЭтоСберБанкСБП И Не ЭтоСбербанкПлатиQR;   
	Элементы.URLБанка.Видимость						  = Не ЭтоРайффайзенБанкСБП И Не ЭтоТинькоффСБП И Не ЭтоСБПСДМ И Не ЭтоАльфаБанкСБП;   
	Элементы.ГруппаСБПСберБанк.Видимость			  = ЭтоСберБанкСБП ИЛИ ЭтоСбербанкПлатиQR;
    Элементы.IDQR.Видимость							  = ЭтоСбербанкПлатиQR;
	Элементы.ВремяЖизниСсылкиНаОплату.ТолькоПросмотр  = ЭтоСберБанкСБП ИЛИ ЭтоСбербанкПлатиQR;
	
	Элементы.ПарольБанка.Заголовок      		= ?(ЭтоРайффайзенБанкСБП, "Секретный ключ", "Пароль");
	Элементы.ПарольБанка.ПодсказкаВвода 		= ?(ЭтоРайффайзенБанкСБП, "Секретный ключ", "Пароль");
    Элементы.ЛогинБанка.Заголовок				= ?(ЭтоРайффайзенБанкСБП, "Мерчант", "Логин");    
	Элементы.СекретныйКлючТинькофф.Заголовок	= ?(ЭтоСБПСДМ, "Пароль ключа", Элементы.СекретныйКлючТинькофф.Заголовок);
	
	Элементы.ГруппаЛогинПарольБанка.Видимость = ЭтоРайффайзенБанкСБП ИЛИ ЭтоАльфаБанкСБП;
	Элементы.ГруппаКлючиТинькофф.Видимость	  = ЭтоТинькоффСБП ИЛИ ЭтоСБПСДМ;
	Элементы.ГруппаQRЭквайринга.Видимость	  = ЭтоРайффайзенБанкСБП ИЛИ ЭтоТинькоффСБП ИЛИ ЭтоСБПСДМ ИЛИ ЭтоАльфаБанкСБП ИЛИ ЭтоСберБанкСБП ИЛИ ЭтоСбербанкПлатиQR;
    Элементы.ЗакрытыйКлюч.Видимость			  = ЭтоАльфаБанкСБП;
	Элементы.ТестоваяСсылкаНаОплату.Видимость = ЭтоТинькоффСБП; 
	
	Если ПриСоздании = Ложь Тогда
		ЭтотОбъект.UrlRedirect				= ?(ЭтоРайффайзенБанкСБП ИЛИ ЭтоТинькоффСБП ИЛИ ЭтоСБПСДМ ИЛИ ЭтоАльфаБанкСБП ИЛИ ЭтоСберБанкСБП ИЛИ ЭтоСбербанкПлатиQR, ПолучитьАдресПубликацииСБП(), ЭтотОбъект.UrlRedirect);
		ЭтотОбъект.ВремяЖизниСсылкиНаОплату = ?(ЭтоРайффайзенБанкСБП ИЛИ ЭтоТинькоффСБП ИЛИ ЭтоСБПСДМ ИЛИ ЭтоАльфаБанкСБП ИЛИ ЭтоСберБанкСБП ИЛИ ЭтоСбербанкПлатиQR, 72, ЭтотОбъект.ВремяЖизниСсылкиНаОплату);	
		ЭтотОбъект.ТестовыйРежим			= ?(ЭтоТинькоффСБП ИЛИ ЭтоСБПСДМ ИЛИ ЭтоСберБанкСБП ИЛИ ЭтоСбербанкПлатиQR, Ложь, ЭтотОбъект.ТестовыйРежим);
		Объект.ИспользоватьОплатуПоСсылке	= ?(ЭтоРайффайзенБанкСБП ИЛИ ЭтоТинькоффСБП ИЛИ ЭтоСБПСДМ ИЛИ ЭтоАльфаБанкСБП ИЛИ ЭтоСберБанкСБП ИЛИ ЭтоСбербанкПлатиQR, Ложь, Объект.ИспользоватьОплатуПоСсылке);
	КонецЕсли;
	
	ТипЭквайрингаПриИзменении(ЭтаФорма, Истина);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "РазрешитьРедактированиеРеквизитовОбъектаЗавершение"
//
Процедура РазрешитьРедактированиеРеквизитовОбъектаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Массив") И Результат.Количество() > 0 Тогда
		ЗапретРедактированияРеквизитовОбъектовКлиент.УстановитьДоступностьЭлементовФормы(ЭтаФорма, Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, осуществляет отправку данных о банке в CRM.
//
Процедура ОтправитьДанныеОБанкеВCRM()
	
	Попытка
		
		ПараметрыПлатежногоШлюза 		= СформироватьСтруктуруПараметровПлатежногоШлюза();
		ВнешниеСистемыВиджетаРасписания = Справочники.ВнешниеСистемы.ПолучитьВнешниеСистемы(Перечисления.ТипыВнешнихСистем.ВиджетРасписания, Истина);
		
		Для Каждого ВнешняяСистема Из ВнешниеСистемыВиджетаРасписания Цикл
			
			api_key                 = ПолучитьЗначенияРеквизитовПоСсылке(ВнешняяСистема.Ссылка, "КлючПриложения");
			ПараметрыВнешнейСистемы = ПолучитьЗначенияРеквизитовПоСсылке(ВнешняяСистема.Ссылка, "Параметры");
			ПараметрыВнешнейСистемы = ПараметрыВнешнейСистемы.Получить();
			
			МассивСЭС = ПолучитьЗначениеИзСтруктуры(ПараметрыВнешнейСистемы, "МассивСтруктурноЭквайринговыхСоответствий", Новый Массив);
			
			Для Каждого ЭлементаМ Из МассивСЭС Цикл
				
				Если ЭлементаМ.ЭквайринговыйТерминал <> Объект.Ссылка Тогда
					Продолжить;
				КонецЕсли;	
				
				СтруктураПараметров = Справочники.ЭквайринговыеТерминалы.СформироватьСтруктуруПараметровБанка(
				ПараметрыПлатежногоШлюза,
				api_key,
				ЭлементаМ.СтруктурнаяЕдиница,
				Объект.Ссылка
				);
				
				ПараметрыЗапроса = ОбщегоНазначения.СформироватьСтрокуJSON(СтруктураПараметров);
				ВыполнитьPOSTЗапрос("update_bank_reservi", ПараметрыЗапроса);
				
			КонецЦикла;	
			
		КонецЦикла;
		
	Исключение
	КонецПопытки;
	
КонецПроцедуры	

&НаСервере
// Функция, возвращает значение из структуры по ключу.
//
Функция ПолучитьЗначениеИзСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено)
	
	Возврат ОбщегоНазначенияКлиентСервер.ПолучитьЗначениеИзСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию);
	
КонецФункции

&НаСервере
// Процедура, выполняет пост запрос к CRM. 
//
Процедура ВыполнитьPOSTЗапрос(Метод, ТекстЗапроса)
	
	ПараметрыЛК = ЛичныйКабинет.ПараметрыПодклчюенияК_API_CRM();
	
	Соединение = Новый HTTPСоединение(
	ПараметрыЛК.АдресСервера,, 
	ПараметрыЛК.Пользователь,
	ПараметрыЛК.Пароль);
	
	///CRM/hs/api/v1/
	HTTPЗапрос = Новый HTTPЗапрос(ПараметрыЛК.АдресПубликации + Метод);
	HTTPЗапрос.УстановитьТелоИзСтроки(ТекстЗапроса);
	
	Результат = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
	
КонецПроцедуры

&НаКлиенте
// Функция формирует наименование банковского счета.
//
Функция СформироватьАвтоНаименование()
	
	Элементы.Наименование.СписокВыбора.Очистить();
	
	СтрокаНаименования = Лев(СокрЛП(Строка(Объект.Эквайер)) + ", " + СокрЛП(Строка(Объект.Организация)), 100);
	
	Элементы.Наименование.СписокВыбора.Добавить(СтрокаНаименования);
	
	Возврат СтрокаНаименования; 
	
КонецФункции 

&НаСервере
// Функция - Подключить внешнюю систему.
// 
Функция ПодключитьВнешнююСистему(ТипВнешнейСистемы, КлючВнешнейСистемы, ОписаниеОшибки = Неопределено)
	
	ВнешняяСистема = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(КлючВнешнейСистемы, ТипВнешнейСистемы, Ложь); 
	
	Если ЗначениеЗаполнено(ВнешняяСистема) Тогда
		Возврат ОбновитьВнешнююСистему(ВнешняяСистема, Истина, ОписаниеОшибки);
	КонецЕсли;
	
	Возврат СоздатьВнешнююСистему(ТипВнешнейСистемы, КлючВнешнейСистемы, ОписаниеОшибки);
	
КонецФункции

&НаСервере
// Функция - Создать внешнюю систему.
//
Функция СоздатьВнешнююСистему(ТипВнешнейСистемы, КлючВнешнейСистемы, ОписаниеОшибки = Неопределено)
	
	ВнешняяСистема   = Справочники.ВнешниеСистемы.СоздатьВнешнююСистему(
		ТипВнешнейСистемы, Строка(ТипВнешнейСистемы) + " " + Строка(Объект.Ссылка),, КлючВнешнейСистемы, Объект.Ссылка);
	УидСессии        = ЛичныйКабинет.УидТекущейСессии();	
	РезультатЗапроса = ЛичныйКабинет.СоздатьВнешнююСистемуВ_CRM(ВнешняяСистема, УидСессии);
	
	Если Не РезультатЗапроса.ВыполненоУспешно Тогда
		
		Справочники.ВнешниеСистемы.УстановитьСостояниеВнешнейСистеме(ВнешняяСистема, Ложь, Ложь);
		ОписаниеОшибки = РезультатЗапроса.ОписаниеОшибки;
	Иначе
		Справочники.ВнешниеСистемы.УстановитьСостояниеВнешнейСистеме(ВнешняяСистема, Истина, Истина);
		
	КонецЕсли;
	
	Возврат ВнешняяСистема;
	
КонецФункции

&НаСервере
// Функция, включает/отключает внешнюю систему.
//
Функция ОбновитьВнешнююСистему(ВнешняяСистема, Используется = Истина, ОписаниеОшибки = Неопределено)
	
	УидСессии        = ЛичныйКабинет.УидТекущейСессии();		
	РезультатЗапроса = ЛичныйКабинет.ОбновитьВнешнююСистемуВ_CRM(ВнешняяСистема, Используется, УидСессии);		
	
	Если РезультатЗапроса.ВыполненоУспешно Тогда		
		Справочники.ВнешниеСистемы.УстановитьСостояниеВнешнейСистеме(ВнешняяСистема, Используется, Используется);				
	Иначе	
		ОписаниеОшибки = РезультатЗапроса.ОписаниеОшибки;	
	КонецЕсли;
	
	Возврат ВнешняяСистема;
		
КонецФункции

&НаСервере
// Процедура - Прокинуть веб хук ВСБП
//
Процедура ПрокинутьВебХукВСБП()
	
	ЗаголовкиHTTP = Новый Соответствие;	
	ЗаголовкиHTTP.Вставить("Accept-Language"	, "ru");	
	ЗаголовкиHTTP.Вставить("Content-Type"		, "application/json");
	ЗаголовкиHTTP.Вставить("Authorization"		, "Bearer " + ПарольБанка);
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("callbackUrl", UrlRedirect);
	
	ТекстЗапроса = КодироватьВJSON(ПараметрыЗапроса);
	
	Соединение = Новый HTTPСоединение(?(ТестовыйРежим, "test.ecom.raiffeisen.ru", "e-commerce.raiffeisen.ru"),,,,,, Новый ЗащищенноеСоединениеOpenSSL());	
	HTTPЗапрос = Новый HTTPЗапрос("/api/settings/v1/callback", ЗаголовкиHTTP);			
	HTTPЗапрос.УстановитьТелоИзСтроки(ТекстЗапроса);		
	
	Попытка		
		HTTPОтвет	 = Соединение.ОтправитьДляОбработки(HTTPЗапрос);		
	Исключение			
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Процедура - Сменить публикацию
//
Функция ПолучитьАдресПубликацииСБП(ИспользоватьТранслятор = Истина)
	
	ВнешняяСистема = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.СистемаБыстрыхПлатежей, Истина); 
	
	Если НЕ ЗначениеЗаполнено(ВнешняяСистема) Тогда			
		ВнешняяСистема = Справочники.ВнешниеСистемы.СоздатьВнешнююСистему(Перечисления.ТипыВнешнихСистем.СистемаБыстрыхПлатежей,, Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВнешняяСистема) Тогда
		
		АдресРетранслятора	= "https://cloud.stoma1c.ru/api";
		HTTPСервис			= "/hs/api/sbp/{apikey}";
		HTTPСервис			= СтрЗаменить(HTTPСервис, "{apikey}", ВнешняяСистема.КлючПриложения);	
		
		Если ИспользоватьТранслятор Тогда
			Возврат "" + АдресРетранслятора + HTTPСервис;
		Иначе 
			АдресПубликации = Константы.ВнешняяПубликацияАдрес.Получить();		
			АдресПубликации = СокрЛП(АдресПубликации);
			АдресПубликации = ?(СтрЗаканчиваетсяНа(АдресПубликации, "/"),  Лев(АдресПубликации, СтрДлина(АдресПубликации)-1), АдресПубликации);
			Возврат "" + АдресПубликации + HTTPСервис;
		КонецЕсли;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

&НаКлиенте
// Процедура - После закрытия формы генерации QR
//
// Параметры:
//  Результат	 - 	 - 
//  Параметры	 - 	 - 
//
Процедура ПослеЗакрытияФормыГенерацииQR(Результат, Параметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") И Результат.Свойство("АдресШаблона") Тогда
		ЭтотОбъект.АдресШаблона = Результат.АдресШаблона;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, сохраняет параметры платежного шлюза.
//
Процедура СохранитьПараметрыПлатежногоШлюза(ТекущийОбъект)
	
	ПараметрыПлатежногоШлюза = СформироватьСтруктуруПараметровПлатежногоШлюза();
	ТекущийОбъект.ПараметрыПлатежногоШлюза = Новый ХранилищеЗначения(ПараметрыПлатежногоШлюза);
	
КонецПроцедуры

&НаСервере
Функция СформироватьСтруктуруПараметровПлатежногоШлюза()
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("UrlRedirect"  	  		 	, ЭтотОбъект.UrlRedirect);
	СтруктураПараметров.Вставить("URLБанка"     	  	 	 	, ЭтотОбъект.URLБанка);
	СтруктураПараметров.Вставить("ЛогинБанка"   	  		 	, ЭтотОбъект.ЛогинБанка);
	СтруктураПараметров.Вставить("ПарольБанка"  	  		 	, ЭтотОбъект.ПарольБанка);
	СтруктураПараметров.Вставить("ТестовыйРежим"	  		 	, ЭтотОбъект.ТестовыйРежим);
	СтруктураПараметров.Вставить("ВремяЖизни"   	  		 	, ЭтотОбъект.ВремяЖизниСсылкиНаОплату);
	СтруктураПараметров.Вставить("КлючТерминалаТинькофф"	 	, ЭтотОбъект.КлючТерминалаТинькофф);
	СтруктураПараметров.Вставить("СекретныйКлючТинькофф"	 	, ЭтотОбъект.СекретныйКлючТинькофф);
	СтруктураПараметров.Вставить("ЗакрытыйКлюч"				 	, ЭтотОбъект.ЗакрытыйКлюч);
	СтруктураПараметров.Вставить("IDТерминала"				 	, ЭтотОбъект.IDТерминала);
	СтруктураПараметров.Вставить("IDQR"				 			, ЭтотОбъект.IDQR);
	СтруктураПараметров.Вставить("КлючМерчанта"				 	, ЭтотОбъект.КлючТерминалаТинькофф);
	СтруктураПараметров.Вставить("ПарольКлючаМерчанта"			, ЭтотОбъект.СекретныйКлючТинькофф);
	
	Возврат СтруктураПараметров;
	
КонецФункции

&НаСервере
// Процедура, заполняет параметры платежного шлюза.
//
Процедура ЗаполнитьПараметрыПлатежногоШлюза()
	
	ПараметрыПШ = Объект.Ссылка.ПараметрыПлатежногоШлюза.Получить();
	Если ТипЗнч(ПараметрыПШ) = Тип("Структура") Тогда
		
		ЭтотОбъект.UrlRedirect               	= ПараметрыПШ.UrlRedirect;
		ЭтотОбъект.URLБанка                  	= ПараметрыПШ.URLБанка;
		ЭтотОбъект.ЛогинБанка                	= ПараметрыПШ.ЛогинБанка;
		ЭтотОбъект.ПарольБанка               	= ПараметрыПШ.ПарольБанка;
		ЭтотОбъект.ТестовыйРежим             	= ПараметрыПШ.ТестовыйРежим;
		ЭтотОбъект.ВремяЖизниСсылкиНаОплату  	= ПараметрыПШ.ВремяЖизни;
		ЭтотОбъект.КлючТерминалаТинькофф     	= ПолучитьЗначениеИзСтруктуры(ПараметрыПШ, "КлючТерминалаТинькофф");
		ЭтотОбъект.СекретныйКлючТинькофф     	= ПолучитьЗначениеИзСтруктуры(ПараметрыПШ, "СекретныйКлючТинькофф");
		ЭтотОбъект.ЗакрытыйКлюч    			 	= ПолучитьЗначениеИзСтруктуры(ПараметрыПШ, "ЗакрытыйКлюч");
		ЭтотОбъект.IDТерминала    			 	= ПолучитьЗначениеИзСтруктуры(ПараметрыПШ, "IDТерминала");
		ЭтотОбъект.IDQR    			 			= ПолучитьЗначениеИзСтруктуры(ПараметрыПШ, "IDQR");
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, возвращает список значений кассовых серверов по драйверу аоборудования.
//
Функция ПолучитьКассовыеСервераПоДрайверуОборудования(ТипФискализации, Организация, ТекстПоиска = "")
	
	ДрайверыОборудования = Новый Массив;
	
	Если ТипФискализации = ПредопределенноеЗначение("Перечисление.ТипыФискализации.КассовыйСервер") Тогда
		ДрайверыОборудования.Добавить(Справочники.ДрайверыОборудования.ДрайверКассовогоСервера);
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПодключаемоеОборудование.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ГДЕ
	|	ПодключаемоеОборудование.ДрайверОборудования В(&ДрайверыОборудования)
	|	И НЕ ПодключаемоеОборудование.ПометкаУдаления
	|	И &УсловиеАвтоПодбора
	|	И &УсловиеОрганизация
	|	И ПодключаемоеОборудование.УстройствоИспользуется");
	
	Запрос.УстановитьПараметр("ТекстПоиска"			, "%" + ТекстПоиска + "%");
	Запрос.УстановитьПараметр("ДрайверыОборудования", ДрайверыОборудования);
	Запрос.УстановитьПараметр("Организация"         , Организация);
	
	УсловиеАвтоПодбора = ?(ЗначениеЗаполнено(ТекстПоиска), "И ПодключаемоеОборудование.Наименование ПОДОБНО &ТекстПоиска", "");
	Запрос.Текст 	   = СтрЗаменить(Запрос.Текст, "И &УсловиеАвтоПодбора", УсловиеАвтоПодбора);
	
	УсловиеОрганизация = ?(ЗначениеЗаполнено(Организация), "И ПодключаемоеОборудование.Организация = &Организация", "");
	Запрос.Текст 	   = СтрЗаменить(Запрос.Текст, "И &УсловиеОрганизация", УсловиеОрганизация);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.ЗагрузитьЗначения(Результат.ВыгрузитьКолонку("Ссылка"));
	
	Возврат СписокЗначений;
	
КонецФункции

// Процедура - Подключаемый разрешить редактирование реквизитов объекта завершение
// Завершение немодального открытия окна формы -  Справочник Эквайринговые терминалы - РазблокированиеРеквизитов
// Параметры:
//  Результат	 - 	 Результат Оповещения 
//  Параметры	 - 	 Параметры Оповещения 
//
&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъектаЗавершение(Результат, Параметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Массив") И Результат.Количество() > 0 Тогда
		ЗапретРедактированияРеквизитовОбъектовКлиент.УстановитьДоступностьЭлементовФормы(ЭтаФорма, Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Выбор кассового сервера или онлайн кассы
//
// Параметры:
//  Результат	 - 	 - 
//  ДопПараметры - 	 - 
//
Процедура ВыборКассовогоСервераИлиОнлайнКассы(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Если Объект.ТипФискализации <> Результат.Значение Тогда
			Объект.КассовыйСервер = Неопределено;
		КонецЕсли;
		Объект.ТипФискализации = Результат.Значение;
		Элементы.КассовыйСервер.Видимость = Истина;
		
		ОбработатьИзменениеТипаФискализации(ЭтаФорма, Результат.Представление);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Процедура, обрабатывает изменение типа фискализации.
//
Процедура ОбработатьИзменениеТипаФискализации(Форма, ЗаголовокФискализации)
	
	Элементы 		= Форма.Элементы;
	ТипФискализации = Форма.Объект.ТипФискализации;
	
	Если ТипФискализации = ПредопределенноеЗначение("Перечисление.ТипыФискализации.НеФискализировать")
		ИЛИ ТипФискализации = ПредопределенноеЗначение("Перечисление.ТипыФискализации.ВСбербанке")
		ИЛИ ТипФискализации = ПредопределенноеЗначение("Перечисление.ТипыФискализации.ВТинькофф")
		ИЛИ ТипФискализации = ПредопределенноеЗначение("Перечисление.ТипыФискализации.ВСДМБанке") Тогда
		
		Элементы.КассовыйСервер.Видимость = Ложь;
	ИначеЕсли ТипФискализации = ПредопределенноеЗначение("Перечисление.ТипыФискализации.КассовыйСервер") Тогда
		Элементы.ДекорацияЗаглушка.МаксимальнаяШирина = 6;
	КонецЕсли;
	
	Элементы.ОтобразитьВыборТиповФискализации.Заголовок = ЗаголовокФискализации;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция - Получить кассу подключаемого оборудования
//
// Параметры:
//  ПодключаемоеОборудование - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьКассуПодключаемогоОборудования(ПодключаемоеОборудование)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Кассы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Кассы КАК Кассы
	|ГДЕ
	|	Кассы.ВнешнееОборудование = &ВнешнееОборудование
	|	И Кассы.ПометкаУдаления = ЛОЖЬ");
	
	Запрос.УстановитьПараметр("ВнешнееОборудование", ПодключаемоеОборудование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);
		
КонецФункции

&НаСервереБезКонтекста
// Процедура - Эквайринг привязан к кассе другой организации
//
Функция ПолучитьКассуЭквайринга(ЭквайринговыйТерминал)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	КассыЭквайринговыеТерминалы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Кассы.ЭквайринговыеТерминалы КАК КассыЭквайринговыеТерминалы
	|ГДЕ
	|	КассыЭквайринговыеТерминалы.ЭквайринговыйТерминал = &ЭквайринговыйТерминал");
	
	Запрос.УстановитьПараметр("ЭквайринговыйТерминал", ЭквайринговыйТерминал);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);
	
КонецФункции

&НаСервере
// Процедура - Добавить в кассу эквайринговый терминал
//
Процедура ДобавитьВКассуЭквайринговыйТерминал()
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Касса) И ПолучитьКассуЭквайринга(Объект.Ссылка) = Неопределено Тогда
		
		УстановитьОсновнымЭквайрингом = Не ЗначениеЗаполнено(ЭтотОбъект.Касса.ЭквайринговыйТерминал) И Объект.ТипЭквайринга = Перечисления.ТипыЭквайринговыхТерминалов.Торговый;
		
		ОбъектКасса = ЭтотОбъект.Касса.ПолучитьОбъект();
		
		Если УстановитьОсновнымЭквайрингом = Истина Тогда
			ОбъектКасса.ЭквайринговыйТерминал = Объект.Ссылка; 	
		КонецЕсли;
			
		НоваяСтрока							= ОбъектКасса.ЭквайринговыеТерминалы.Добавить();
		НоваяСтрока.ЭквайринговыйТерминал	= Объект.Ссылка;
		НоваяСтрока.Основной				= УстановитьОсновнымЭквайрингом;
		
		Попытка
			ОбъектКасса.Записать();
		Исключение
		КонецПопытки;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Процедура - Тип эквайринга при изменении
//
Процедура ТипЭквайрингаПриИзменении(Форма, ПриСоздании = Ложь)
	
	Объект		= Форма.Объект;
	Элементы	= Форма.Элементы;
	
	ЭтоОнлайн	= Объект.ТипЭквайринга = ПредопределенноеЗначение("Перечисление.ТипыЭквайринговыхТерминалов.Онлайн");
	ЭтоТорговый	= Объект.ТипЭквайринга = ПредопределенноеЗначение("Перечисление.ТипыЭквайринговыхТерминалов.Торговый"); 
	
	АктивныйФон     = Новый Цвет(25, 116, 206);
	АктивныйЦвет	= Новый Цвет(255, 255, 255);
	НеактивныйФон   = Новый Цвет(235, 235, 237);
	НеактивныйЦвет	= Новый Цвет(77, 77, 77);
	
	Элементы.ГруппаТорговыйЭквайринг.ЦветФона          	= ?(ЭтоТорговый	, АктивныйФон	, НеактивныйФон); 
	Элементы.ПереключательТорговыйЭквайринг.ЦветТекста 	= ?(ЭтоТорговый	, АктивныйЦвет	, НеактивныйЦвет);  
	Элементы.ГруппаОнлайнЭквайринг.ЦветФона           	= ?(ЭтоОнлайн	, АктивныйФон	, НеактивныйФон); 
	Элементы.ПереключательОнлайнЭквайринг.ЦветТекста	= ?(ЭтоОнлайн	, АктивныйЦвет	, НеактивныйЦвет); 
	
	Элементы.ГруппаОборудование.Видимость	= ЭтоТорговый;
	Элементы.ГруппаБанка.Видимость			= ЭтоОнлайн;
		
	Если ПриСоздании = Ложь Тогда
		
		Если ЭтоОнлайн Тогда
			
			Объект.ПодключаемоеОборудование						= Неопределено;	
			Объект.ИспользоватьБезПодключенияОборудования		= Истина;      
			
		ИначеЕсли ЭтоТорговый Тогда
			
			Объект.ТипФискализации								= ПредопределенноеЗначение("Перечисление.ТипыФискализации.НеФискализировать");
			Объект.ТипБанка										= Неопределено;
			Объект.КассовыйСервер 								= Неопределено;
			Объект.ИспользоватьОплатуПоСсылке 					= Ложь;
			Элементы.КассовыйСервер.Видимость 					= Ложь;
			Элементы.ОтобразитьВыборТиповФискализации.Заголовок = "Не фискализировать";
			
		КонецЕсли;
		
		Элементы.ВнешнееОборудование.Доступность				= Не Объект.ИспользоватьБезПодключенияОборудования;
		Форма.ТекущийЭлемент 									= Элементы.Эквайрер;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура - Получить драйвер кассового сервера
//
Функция ПолучитьДрайверКассовогоСервера()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ДрайверыОборудования.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДрайверыОборудования КАК ДрайверыОборудования
	|ГДЕ
	|	ДрайверыОборудования.ИмяПредопределенныхДанных = ""ДрайверКассовогоСервера""");
	
	Выборка = Запрос.Выполнить().Выбрать();

	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
// Процедура - Заполнить список выбора кассового сервера
//
Процедура ЗаполнитьСписокВыбораКассовогоСервера(ОбъектТипФискализации, ОбъектОрганизация, ЭлементКассовыйСервер)
	
	ЭлементКассовыйСервер.СписокВыбора.Очистить();
	СписокДрайверов = ПолучитьКассовыеСервераПоДрайверуОборудования(ОбъектТипФискализации, ОбъектОрганизация);	
	
	Для Каждого СтрокаСписка Из СписокДрайверов Цикл
		ЭлементКассовыйСервер.СписокВыбора.Добавить(СтрокаСписка.Значение);		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
